Repository: printpagestopdf/cb_app
Catalog: lib/l10n/app_*.arb
Languages: de

# accountOrApplicationPasswordMustBeFilled
source: Account- or Apllication password must be filled
de: Entweder Account- oder Awendungspasswort angeben

source: Account password
de: Accountpasswort

source: Add Account
de: Account neu

source: Add comment
de: Bemerkung hinzufügen

source: Address
de: Adresse

source: Add Service
de: Service neu

# addValidLink
source: Please use valid Url
de: Bitte einen gültigen Link eingeben

# anErrorOccured
source: An error has occurred
de: Es ist ein Fehler aufgetreten

source: Application password
de: Anwendungspassword

source: Article Info
de: Artikelinfo

# askForDeletion
source: Do you really want to delete this {topic}?
de: {topic} wirklich endgültig löschen?

source: Availabilities
de: Verfügbarkeiten

source: Booking
de: Buchung

# bookingCancelButton
source: {isHorizontal, select, true{Cancel booking} false{Cancel booking} other{}}
de: {isHorizontal, select, true{Buchung stornieren} false{Buchung stornieren} other{}}

# bookingComment
source: Comments for this Booking
de: Anmerkung zu dieser Buchung

# bookingConfirmButton
source: {isHorizontal, select, true{Confirm booking} false{Confirm booking} other{}}
de: {isHorizontal, select, true{Buchung bestätigen} false{Buchung bestätigen} other{}}

source: Bookinglimits
de: Buchungslimits

source: Book item
de: Artikel buchen

source: Calendar
de: Kalender

source: Cancel
de: Abbruch

# changeViewButtonTooltip
source: {isMainViewMap, select, true{Switch to list view} false{Switch to map view} other{}}
de: {isMainViewMap, select, true{Wechseln zur Listenansicht} false{Wechseln zur Kartenansicht} other{}}

source: Clear date selection
de: Datumsselektion aufheben

source: Close
de: Schließen

source: Common
de: Allgemein

source: confirm
de: bestätigen

source: Contact
de: Kontakt

source: Data
de: Daten

source: Delete
de: Löschen

# deleteOfflineData
source: Clear offline data
de: Offline-Daten löschen

source: Displayname
de: Anzeigename

# edit
source: edit {topic}
de: {topic} bearbeiten

# emptyBookingList
source: No current or future bookings available
de: Keine aktuellen oder zukünftigen Buchungen vorhanden

# enableOfflineUse
source: Offline use {isOfflineEnabled, select, true{enabled} false{disabled} other{}}
de: Offline-Nutzung {isOfflineEnabled, select, true{aktiviert} false{deaktiviert} other{}}

source: english
de: englisch

# errLoginFailed
source: Login failed
de: Anmeldung fehlgeschlagen

# errNoConnectionCacheEmpty
source: No Service connection and empty cache
de: Keine Serviceverbindung und keine Cache Daten

# errRetrieveAppPassword
source: Error: Application password not determined
de: Fehler: Anwendungspasswort nicht ermittelt

# errSaveAccountAnyway
source: Application password error: Save account anyway?
de: Anwendungspasswort Fehler: Account trotzdem speichern?

source: Field must not be empty
de: Feld darf nicht leer sein

source: From
de: Von

source: german
de: deutsch

source: Goto current location
de: Standort anzeigen

# hdrStartupAction
source: App startup action
de: Aktion beim Starten der App

source: Image display not possible
de: Bildanzeige nicht möglich

# infoAppPassword
source: An application password is required to log in to the service provider. If you have an account with the service provider, it is sufficient to enter your Accountpassword the application password will then be generated automatically. If you have received an application password from the service provider, or if you have created on your own, you can enter it directly in the Application password field instead.
de: Für die Anmeldung beim Serviceprovider wird ein Anwendungspasswort benötigt. Wenn sie über einen Account beim Serviceanbieter verfügen reicht die Eingabe ihres Accountpassworts das Anwendungspasswort wird dann autom. erzeugt. Sollten sie ein Anwendungspasswort vom Serviceprovider erhalten, oder dieses selbst angelegt haben, können sie es im Feld Anwendungspasswort stattdessen direkt eingeben.

# infoSelectServiceprovider
source: Select Serviceprovider!
de: Serviceanbieter auswählen!

source: language
de: sprache

# lastUpdated
source: Last updated: {dateTime}
de: Zuletzt aktualisiert: {dateTime}

# linkForInternettest
source: Url for testing Connectivity
de: Url für Internet Verbindungstest

source: Log in
de: Anmelden

# loginWithNewAccount
source: Do you want to log in with the new account now?
de: Wollen sie sich mit dem neuen Account jetzt anmelden?

source: Menu
de: Menü

# msgAppAPIavailable
source: App Extension API available!
de: App Extension API vorhanden!

# msgAppLoginAvailable
source: App Login active
de: App Login aktiviert

# msgCacheDeleted
source: Offline-Data deleted for this Serviceprovider
de: Offline-Daten für diesen Serviceprovider gelöscht

# msgCbAPIAvailable
source: CommonsBooking API available!
de: CommonsBooking API vorhanden!

# msgCheckUrl
source: Check Url
de: Teste Url

# msgDataModified
source: Data changed
de: Daten geändert

# msgFailed
source: Failed!
de: Fehler!

# msgLinkAvailable
source: Url connected successfully!
de: Link Adresse erreichbar!

# msgNetworkAvailable
source: Network available
de: Netzwerk verfügbar

# msgNetworkUnavailable
source: Network unavailable
de: Kein Netzwerk verfügbar

# msgRequestFinishedWithError
source: Request finished with error code:
de: Anfrage beendet mit Fehlercode:

# msgRestAPIAvailable
source: Rest API available!
de: Rest API Adresse erreichbar!

# netTimeoutInSeconds
source: Network timeout in seconds
de: Netzwerktimeout in Sekunden

# netwokTest
source: Test Network Connectivity
de: Netzwerkverbindung testen

# newText
source: New
de: Neu

source: No rental in this period
de: Kein Verleih in diesem Zeitraum

source: No service
de: Kein Service

source: not logged in
de: nicht angemeldet

# openBookingCalendar
source: Bookingcalendar
de: zur Buchung

source: Open in new Window
de: In neuem Fenster öffnen

# optStartupAction
source: {startupAction, select, none{None} last{Last service/user (online)} last_offline{Last service/user (offline)} other{}}
de: {startupAction, select, none{Keine} last{Letzter Service/Benutzer (Online)} last_offline{Letzter Service/Benutzer (Offline)} other{}}

# orAddAccountPassword
source: alternatively add Account password
de: Oder Accountpasswort eingeben

# orAddApplicationPassword
source: alternatively add Application password
de: Oder Anwendungspasswort eingeben

source: Pickup Instructions
de: Abhol-Hinweise

source: please select
de: bitte auswählen

# questStillContinue
source: Changes exist do you still want to continue
de: Es existieren Änderungen wollen sie trotzdem weiter?

# register
source: register {topic}
de: {topic} registrieren

source: Reload
de: Aktualisieren

# reloadLocations
source: Reload ....
de: Neu laden ...

source: Reset Map View
de: Kartenansicht zurücksetzen

# restAPITest
source: REST API connectivity
de: REST API Verbindungstest

source: Save
de: Speichern

source: Saved successfully
de: Erfolgreich gespeichert

source: seconds
de: Sekunden

# select
source: select {topic}
de: {topic} auswählen

source: Serviceprovider
de: Serviceanbieter

# setTimeoutUnlimited
source: Set timeout to unlimited
de: Timeout auf unbegrenzt setzen

source: Settings
de: Einstellungen

source: Shortinfo
de: Kurzinfo

source: Show Bookings List
de: Buchungsliste anzeigen

# showZoomButtons
source: Show zoom buttons on map
de: Zoom Buttons auf Karte anzeigen

# siteConnectionTest
source: Website connectivity
de: Website Verbindungstest

source: Stationinfo
de: Stationsinfo

# storno
source: cancel
de: stornieren

# titleCreateAccount
source: Create Account
de: Account anlegen

# tooltipFilter
source: Restrict display according to certain criteria
de: Anzeige nach best. Kriterien einschränken

source: unknown HTTP Status
de: unbekannter HTTP Status

source: unlimited
de: unbegrenzt

source: Until
de: Bis

# useNewServiceQuestion
source: Should the new service be used now?
de: Soll der neue Service jetzt verwendet werden?

source: Your Bookings
de: Ihre Buchungen
